{
  "name": "Tun Keltesch",
  "title": "Junior Project Engineer | Software Engineer",
  "description": "I build robust, user-friendly, and visually appealing web solutions, with a passion for continuous technical innovation.",
  "about": [
    "In the past 5 years, I embarked on my journey as a tech enthusiast, diving deep into the world of coding and web development. Fast-forward to today, and I've had the incredible opportunity to work on a wide range of projects, from building and maintaining websites to capturing stunning aerial footage with drone technology.",
    "Currently, I am a Junior Project Engineer at Hexagon in Vienna, Austria, where I continue to tackle new challenges and expand my expertise. I am passionate about creating unique perspectives and combining my technical skills with creativity.",
    "I speak Luxemburgish, French, German, English, and some Portuguese, which helps me connect with a diverse range of clients and colleagues.",
    "Contact me, and let's see how we can create something amazing together!"
  ],
  "experience": [
    {
      "date": "2024-07 — Present",
      "jobTitle": "Junior Project Engineer",
      "company": "Hexagon",
      "company_link": "https://www.hexagon.com",
      "description": "As a Junior Project Engineer at Hexagon in Vienna, Austria, I support the planning, implementation, and management of engineering projects.",
      "skills": ["SQL", "C#", "SQL Server", "Azure DevOps", "VBA"]
    },
    {
      "date": "2023-02 — 2024-06",
      "jobTitle": "Software Engineer (Working Student)",
      "company": "dyve GMBH",
      "company_link": "https://dyve.agency",
      "description": "Developed and maintained a Shopify website and contributed to the new version of Dyve GmbH's website, working flexibly from 8 to 30 hours a week based on project needs.",
      "skills": ["JavaScript", "TypeScript", "Tailwind CSS", "Next.js", "GSAP", "Liquid", "Storyblok", "Shopify"]
    },
    {
      "date": "2023-09 — 2024-01",
      "jobTitle": "Software Engineer",
      "company": "Agile Data Innovation GmbH",
      "company_link": "https://agiledatainnovation.de",
      "description": "Developed an attack tree visualization tool for the Frauenhofer Institut using Angular, TypeScript, and D3.js. Built AI chatbots, improved websites, and handled frontend/backend tasks for multiple projects.",
      "skills": ["Python", "TypeScript", "React", "Angular", "OpenAI API", "Figma", "D3.js"]
    },
    {
      "date": "2023-04 — 2023-07",
      "jobTitle": "Internship (System programming lab)",
      "company": "Chair of Embedded Software at RWTH Aachen University",
      "company_link": "https://www.rwth-aachen.de",
      "description": "Implemented an OS for an ATmega 644 using C. Gained hands-on experience in low-level programming and embedded systems development.",
      "skills": ["C", "Embedded Systems", "OS Development"]
    },
    {
      "date": "2020-08 — 2023-09",
      "jobTitle": "Customer Technical Support",
      "company": "Luxembourg Online S.A.",
      "company_link": "https://www.internet.lu",
      "description": "Provided first-level support to private clients and extended support to business clients, handling internet connectivity issues. Tested and provided feedback on internal tools, enhancing knowledge of web technologies and frontend development.",
      "skills": ["Technical Support", "Troubleshooting", "Customer Service", "Web Technologies", "Frontend Development"]
    }
  ],  
  "certificates": [
      {
        "date": "2022-11-22",
        "jobTitle": "Specialization Certificate - Google UX Design",
        "title_link": "https://www.coursera.org/account/accomplishments/specialization/certificate/SQD9Z8VSSXN2",
        "company": "Google",
        "description": "Completed seven courses that cover the entire UX design process, including empathizing with users, defining pain points, ideating design solutions, creating wireframes and prototypes, and testing designs for feedback."
      },
      {
        "date": "2022-09-11",
        "jobTitle": "Specialization Certificate - Google IT Automation with Python",
        "title_link": "https://www.coursera.org/account/accomplishments/specialization/certificate/CX4GYR2C4FPH",
        "company": "Google",
        "description": "Completed multiple courses including Crash Course on Python, Troubleshooting and Debugging Techniques, Introduction to Git and GitHub, Configuration Management and the Cloud. Gained skills in automating tasks with Python, using Git and GitHub for version control, managing IT resources at scale, and analyzing real-world IT problems to implement appropriate solutions."
      },
      {
        "date": "2024-07-26",
        "jobTitle": "The Complete SQL Bootcamp: Go from Zero to Hero",
        "title_link": "https://www.udemy.com/certificate/UC-9f6b9847-ecdf-44af-89d3-7b6590eef0d8/",
        "company": "Udemy",
        "description": "Gained skills in reading and writing complex SQL queries, utilizing PostgreSQL, and applying these techniques across various major SQL databases. Learned to analyze data with aggregate functions, execute advanced queries, use logical operators, and manage databases efficiently."
      },
      {
        "date": "2024-07-26",
        "jobTitle": "C# Basics for Beginners: Learn C# Fundamentals by Coding",
        "title_link": "https://www.udemy.com/certificate/UC-00433bd6-c8d0-4ffb-88fb-b33823ce0b22/",
        "company": "Udemy",
        "description": "Learned the fundamentals of C# and .NET Framework, working with primitive and non-primitive types, controlling program flow with conditional statements, using arrays and lists, and working with files, directories, text, and date and time. Also gained skills in debugging C# applications effectively."
      },
      {
        "date": "2024-07-26",
        "jobTitle": "C# Intermediate: Classes, Interfaces and OOP",
        "title_link": "https://www.udemy.com/certificate/UC-326c8ea5-bc10-4628-99d2-5c5d4860456c/",
        "company": "Udemy",
        "description": "Gained skills in working with classes, interfaces, and object-oriented programming principles with C#. Learned to utilize encapsulation, inheritance, and composition to enhance code robustness and reusability. Developed expertise in building extensible, loosely-coupled, and testable applications using polymorphism and interfaces."
      }
  ],      
  "education": [
    {
      "jobTitle": "Bachelor of Science - Computer Science",
      "company": "RWTH Aachen University",
      "company_link": "https://www.rwth-aachen.de"
    },
    {
      "jobTitle": "General Certificate of Secondary Education",
      "company": "Lycée Classique de Diekirch",
      "company_link": "https://www.lcd.lu/",
      "description": "Advanced level in Economics and Mathematics"
    }
  ],
  "projects": [
      {
          "title": "SwiftDrones Website",
          "description": "A website for a drone company.",
          "big_description": [
            "The SwiftDrones Website project involved creating a comprehensive online presence for SwiftDrones, a company specializing in drone technology and services.",
            "Our team of drone enthusiasts, based in Luxembourg, is dedicated to providing clients with high-quality imagery for various applications. We leverage cutting-edge drone technology to deliver compelling visual content that meets the unique requirements of each client.",
            "The website is built with React and styled using TailwindCSS. We utilize Google Cloud to host our images and videos, ensuring high availability and performance.",
            "This project is a labor of love, reflecting our passion for drones and our commitment to excellence in aerial photography and videography."
          ],
          "github_link": "github.com/SM1LE21/drone-services",
          "link": "swiftdrones.net",
          "link_text": "swiftdrones.net",
          "image": "/assets/swiftdrones.png",
          "video": "",
          "showMainMedia": false,
          "embedWebsite": true,
          "embedLink": "swiftdrones.net",
          "skills": ["React", "JavaScript", "TailwindCSS", "Google Cloud"],
          "content": [
              {   
                  "title": "Here an embedded version of the website:"
              }
          ]
      },
      {
          "title": "CanvasCraft",
          "description": "AI image generation tool, with accurate color palette and style transfer.",
          "big_description": [
              "CanvasCraft is an AI-powered image generation tool designed to create stunning visuals. By leveraging OpenAI's DALL-E 3, CanvasCraft transforms text prompts into detailed images, accurately replicating color palettes and applying various art styles.",
              "Users start by entering simple information. Through the help of GPT, the system refines this initial input by internally communicating with itself, ensuring a highly precise and detailed prompt is constructed. This refined prompt is then sent to DALL-E 3 to generate the final image.",
              "The backend, built with Python and Flask, implements OpenAI's API to ensure high-quality image outputs. Users can specify color palettes, themes, moods, and custom prompts to guide the image generation process.",
              "On the frontend, CanvasCraft utilizes React and TailwindCSS to provide an intuitive user interface. The application offers a range of options for users to select their desired artistic elements and see their visions come to life."
          ],
          "link": "",
          "link_text": "",
          "image": "/assets/canvascraft.png",
          "video": "",
          "showMainMedia": false,
          "embedWebsite": true,
          "embedLink": "widgethoster.sytes.net/canvascraft/",
          "skills": ["Python", "Flask", "OpenAI API", "React", "TailwindCSS"],
          "content": [
              {   
                  "title": "Feel free to test the tool:"
              }
          ]
      },        
      {
          "title": "Text2UML",
          "description": "A VS Code extension for automated generation of graphical representations from textual UML diagrams.",
          "big_description": [
              "I developed the Text2UML tool for my bachelor's thesis titled 'Generating Graphical Representations for UML Sequence and Activity Diagrams from Textual Variants'. This thesis presents a tool that automates the generation of graphical representations from textual variants of UML sequence diagrams (SDs) and activity diagrams (ADs), utilizing the MontiCore language workbench. Designed to enhance model-driven software engineering (MDSE) methodologies, this tool is integrated into the Visual Studio Code (VS Code) environment through an extension.",
              "The tool employs the Language Server Protocol (LSP) to extract diagram data from MontiCore DSLs, enabling synchronized visualization alongside the textual model. A key feature of this tool is the bidirectional navigation between textual and visual representations, allowing users to transition from code to diagram and vice versa. This functionality improves the accessibility and utility of MDSE visualizations and facilitates a deeper understanding of UML diagrams.",
              "The main goal of the tool is to provide direct visualization inside VS Code, allowing for a side-by-side view with the textual model on one side and the visualization on the other. The extension dynamically generates and updates visualizations based on any modifications within the text document.",
              "The tool uses Java for the backend (LSP server) and TypeScript for the VS Code extension backend and frontend. React and D3.js are used for rendering the diagrams. The visualization process is separated into layout algorithms and rendering logic. We use ELKJS for the AD renderer and developed a custom layout algorithm for SDs.",
              "This project not only showcases advanced integration techniques and synchronized data visualization but also contributes to the broader MDSE field by improving the interaction between textual and graphical models."
          ],
          "link": "",
          "link_text": "",
          "image": "",
          "video": "/assets/text2uml.mp4",
          "showMainMedia": false,
          "skills": ["Java", "TypeScript", "React", "D3.js", "ELKJS", "MontiCore", "LSP", "VS-Code Extension"],
          "content": [
              {   
                  "title": "Architectural Overview of Text2UML Tool Communication Flow",
                  "image": "/assets/text2uml_frontendBackendCommunication.png",
                  "description": "",
                  "video": ""
              },
              {
                  "title": "Visualization Workflow",
                  "image": "/assets/text2uml_visualizationWorkflow.png",
                  "description": "",
                  "video": ""
              },
              {
                  "title": "Example Videos of the Tool in Action",
                  "image": "",
                  "description": "",
                  "video": "/assets/text2uml_AD.mov"
              },
              {
                  "image": "",
                  "description": "",
                  "video": "/assets/text2uml_SD.mp4"
              }
          ]
      },        
      {
          "title": "LLInvoker",
          "description": "Personalized language learning through news and generated exercises.",
          "big_description": [
              "The project we're presenting, LLInvoker, is a language learning platform that uses the power of AI to offer personalized and dynamic language exercises. Our goal is to make language learning accessible, engaging, and flexible for modern learners by leveraging advanced natural language processing.",
              "Initially, our ideas focused on using news articles and generated exercises to help users improve their language skills. The platform was designed to allow users to select their target language and proficiency level, after which it would provide relevant news articles in the target language. Exercises based on these articles, such as vocabulary quizzes, grammar exercises, and comprehension questions, were also part of the plan. We intended to continue developing the platform beyond the competition deadline of August 12, 2024.",
              "For the competition, we delivered a platform called LLInvoker that integrates the Gemini API to generate A1-level exercises in both German and French. Users can request customized exercises based on their language level and topics of interest. We also included a feature where Gemini corrects and verifies users' answers, offering a more interactive learning experience. Additionally, users can generate custom exercises through a chat feature, allowing them to select exercise types and incorporate images or descriptions to create personalized learning activities. While the platform is in its alpha stage and some features from our initial plans are still under development, we believe LLInvoker demonstrates significant potential.",
              "Looking forward, we plan to collaborate with educational institutions and introduce more advanced exercises, such as those initially planned with news articles, reading exercises, and conversational practice that offers pronunciation feedback. We're also considering a rework of the frontend to make it more playful and user-friendly, likely switching to React Native due to our team's experience with similar frameworks. To get a better idea of our project, you can check out the video we submitted for the competition."
          ],
          "link": "ai.google.dev/",
          "link_text": "Checkout the Gemini API Developer Competition",
          "image": "/assets/gemini.jpg",
          "video": "https://www.youtube.com/watch?v=DG44aGDvXmo",
          "showMainMedia": true,
          "skills": ["Dart", "Flutter", "Google Cloud", "Firebase", "Google Functions", "Python", "Gemini API"],
          "content": [

          ]
      }
  ],
    
  "socialLinks": [
      {
          "title": "GitHub",
          "url": "https://github.com/SM1LE21",
          "icon": "/icons/github.svg"
      },
      {
          "title": "Email",
          "url": "mailto:tun.keltesch@gmail.com",
          "icon": "/icons/email.svg"
      },
      {
        "title": "LinkedIn",
        "url": "https://www.linkedin.com/in/tun-keltesch-830294250/",
        "icon": "/icons/linkedin.svg"
      }
    ]      
}
